<template>
  <AboutSectionComponent
    :title="t('О нас')"
    :description="
      t(
        'В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования.'
      )
    "
  >
    <!-- Feature Cards as Slots -->
    <template #about>
      <FeatureCard
        :title="t('Кратчайшие сроки')"
        :description="
          t(
            'Нашим клиентам мы обеспечиваем полный контроль и прозрачность операций, а также гарантируем результаты точно в срок и в ожидаемом объеме.'
          )
        "
      >
        <template #icon>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M26.985 22.5283H26.9633L19.415 22.4067C18.7317 22.395 18.185 21.8383 18.185 21.1567V13.0767C18.185 12.3867 18.745 11.8267 19.435 11.8267C20.125 11.8267 20.685 12.3867 20.685 13.0767V19.925L27.005 20.0283C27.695 20.04 28.245 20.6083 28.235 21.2983C28.2233 21.9817 27.665 22.5283 26.985 22.5283ZM20 3.75C11.04 3.75 3.75 11.04 3.75 20C3.75 28.96 11.04 36.25 20 36.25C28.96 36.25 36.25 28.96 36.25 20C36.25 11.04 28.96 3.75 20 3.75Z"
              fill="white"
            />
          </svg>
        </template>
      </FeatureCard>

      <FeatureCard
        :title="t('Высокий уровень производительности')"
        :description="
          t(
            'Исправляем алгоритмы, оптимизируем производительность и повышаем стабильность.'
          )
        "
      >
        <template #icon>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M28.7149 28.1966C28.7149 28.8866 28.1549 29.4466 27.4649 29.4466C26.7749 29.4466 26.2149 28.8866 26.2149 28.1966V22.9349C26.2149 22.2449 26.7749 21.6849 27.4649 21.6849C28.1549 21.6849 28.7149 22.2449 28.7149 22.9349V28.1966ZM21.2499 28.1966C21.2499 28.8866 20.6899 29.4466 19.9999 29.4466C19.3099 29.4466 18.7499 28.8866 18.7499 28.1966V11.6999C18.7499 11.0082 19.3099 10.4499 19.9999 10.4499C20.6899 10.4499 21.2499 11.0082 21.2499 11.6999V28.1966ZM13.6599 28.1966C13.6599 28.8866 13.0999 29.4466 12.4099 29.4466C11.7199 29.4466 11.1599 28.8866 11.1599 28.1966V17.0399C11.1599 16.3499 11.7199 15.7899 12.4099 15.7899C13.0999 15.7899 13.6599 16.3499 13.6599 17.0399V28.1966ZM19.9999 2.93823C7.40157 2.93823 2.93823 7.40157 2.93823 19.9999C2.93823 32.5982 7.40157 37.0616 19.9999 37.0616C32.5966 37.0616 37.0616 32.5982 37.0616 19.9999C37.0616 7.40157 32.5966 2.93823 19.9999 2.93823Z"
              fill="white"
            />
          </svg>
        </template>
      </FeatureCard>

      <FeatureCard
        :title="t('Интуитивный интерфейс пользователя')"
        :description="
          t(
            'Создание удобного пользовательского интерфейса, который повысит степень удовлетворенности пользователей.'
          )
        "
      >
        <template #icon>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M19.9998 24.9999C17.2431 24.9999 14.9998 22.7566 14.9998 19.9999C14.9998 17.2433 17.2431 14.9999 19.9998 14.9999C22.7565 14.9999 24.9998 17.2433 24.9998 19.9999C24.9998 22.7566 22.7565 24.9999 19.9998 24.9999ZM32.5231 21.5233C31.9781 21.2049 31.6515 20.6366 31.6515 19.9999C31.6515 19.3633 31.9781 18.7949 32.5248 18.4783C34.8881 17.1033 35.6998 14.0499 34.3365 11.6683C33.6715 10.5116 32.5998 9.68492 31.3165 9.33992C30.0398 9.00159 28.7065 9.17825 27.5631 9.84325C27.0231 10.1599 26.3781 10.1599 25.8348 9.84492C25.2848 9.52992 24.9565 8.95825 24.9565 8.31992C24.9565 5.57159 22.7331 3.33325 19.9998 3.33325C17.2648 3.33325 15.0415 5.57159 15.0415 8.31992C15.0415 8.95992 14.7131 9.52992 14.1631 9.84659C13.6231 10.1566 12.9781 10.1599 12.4381 9.84325C11.2915 9.17825 9.95979 8.99825 8.67979 9.34159C7.39646 9.68659 6.32646 10.5133 5.66313 11.6699C4.29979 14.0516 5.11313 17.1049 7.47646 18.4766C8.02146 18.7933 8.34646 19.3633 8.34646 19.9999C8.34646 20.6366 8.02146 21.2066 7.47646 21.5216C5.11313 22.8966 4.29979 25.9516 5.66313 28.3316C6.32646 29.4866 7.39646 30.3133 8.67813 30.6583C9.95646 30.9999 11.2915 30.8233 12.4381 30.1583C12.9765 29.8416 13.6215 29.8416 14.1631 30.1533C14.7131 30.4699 15.0415 31.0399 15.0415 31.6799C15.0415 34.4283 17.2648 36.6666 19.9998 36.6666C22.7331 36.6666 24.9565 34.4283 24.9565 31.6799C24.9565 31.0416 25.2848 30.4699 25.8348 30.1549C26.3765 29.8416 27.0215 29.8416 27.5631 30.1583C28.7081 30.8233 30.0415 30.9966 31.3165 30.6599C32.5998 30.3149 33.6715 29.4883 34.3365 28.3316C35.6998 25.9516 34.8881 22.8983 32.5231 21.5233Z"
              fill="white"
            />
          </svg>
        </template>
      </FeatureCard>
    </template>
  </AboutSectionComponent>
</template>
<script setup lang="ts">
import { useI18n } from "vue-i18n";
const { t } = useI18n();
useHead({
  title: "About Us - Webase IT Solutions",
  meta: [
    {
      name: "description",
      content:
        "Learn more about Webase, an IT company specializing in web and mobile applications.",
    },
    {
      name: "keywords",
      content: "Webase, about us, IT solutions, web apps, mobile apps",
    },
    { property: "og:title", content: "About Us - Webase IT Solutions" },
    {
      property: "og:description",
      content:
        "Learn more about Webase and our expertise in web and mobile app development.",
    },
    { property: "og:type", content: "website" },
    { property: "og:url", content: "https://webase.uz/#about" },
    {
      property: "og:image",
      content: "https://webase.uz/#about-image.jpg",
    },
    { name: "twitter:card", content: "summary_large_image" },
    { name: "twitter:title", content: "About Us - Webase IT Solutions" },
    {
      name: "twitter:description",
      content: "Learn more about Webase and our IT solutions.",
    },
    {
      name: "twitter:image",
      content: "https://webase.uz/#about-image.jpg",
    },
  ],
});
</script>
