<template>
  <div class="sm:p-10 text-gray-800">
    <!-- Header Section -->
    <div class="text-center mb-10">
      <h2 class="text-[24px] sm:text-[48px] font-bold mb-4">
        {{ t("Полный цикл разработки") }}
      </h2>
      <p class="text-gray-600 mx-auto" v-if="!$isMobile">
        {{
          t(
            "Вне зависимости от типа и технологической сложности решения, мы обеспечим качественную реализацию функциональности, высокую доступность и производительность системы, а также привлекательный дизайн и безупречное удобство пользования."
          )
        }}
      </p>
    </div>

    <!-- Process Flow Grid -->
    <div class="relative bg-gray-100 rounded-xl p-4 sm:p-8">
      <!-- Top Row of Cards -->
      <div class="grid grid-cols-2 md:grid-cols-5 gap-3 sm:gap-6 mb-0">
        <ProcessCard
          :title="t('Консалтинг')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M31.1898 25.375H16.7498C15.9218 25.375 15.2498 24.703 15.2498 23.875C15.2498 23.047 15.9218 22.375 16.7498 22.375H31.1898C32.0178 22.375 32.6898 23.047 32.6898 23.875C32.6898 24.703 32.0178 25.375 31.1898 25.375ZM31.1898 32.893H16.7498C15.9218 32.893 15.2498 32.221 15.2498 31.393C15.2498 30.565 15.9218 29.893 16.7498 29.893H31.1898C32.0178 29.893 32.6898 30.565 32.6898 31.393C32.6898 32.221 32.0178 32.893 31.1898 32.893ZM16.7498 14.853H22.2598C23.0878 14.853 23.7598 15.525 23.7598 16.353C23.7598 17.181 23.0878 17.853 22.2598 17.853H16.7498C15.9218 17.853 15.2498 17.181 15.2498 16.353C15.2498 15.525 15.9218 14.853 16.7498 14.853ZM23.9998 4.49902C10.8698 4.49902 6.21777 9.60302 6.21777 24.001C6.21777 38.397 10.8698 43.501 23.9998 43.501C37.1278 43.501 41.7818 38.397 41.7818 24.001C41.7818 9.60302 37.1278 4.49902 23.9998 4.49902Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Бизнес-анализ')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M33.3398 21.3301L27.4798 28.8901C27.2398 29.2101 26.8798 29.4101 26.4798 29.4501C26.0798 29.5101 25.6798 29.3901 25.3598 29.1501L19.7198 24.7301L14.6598 31.3101C14.3798 31.6901 13.9198 31.8901 13.4798 31.8901C13.1598 31.8901 12.8398 31.7901 12.5598 31.5701C11.8998 31.0701 11.7798 30.1301 12.2798 29.4701L18.2798 21.6901C18.5198 21.3701 18.8798 21.1701 19.2798 21.1301C19.6798 21.0701 20.0798 21.1901 20.3998 21.4301L26.0398 25.8501L30.9598 19.4901C31.4798 18.8301 32.4198 18.7101 33.0798 19.2301C33.7198 19.7301 33.8398 20.6701 33.3398 21.3301ZM43.5398 16.5501C42.4798 17.0501 41.2798 17.3301 40.0398 17.3301C35.3598 17.3301 31.5398 13.5101 31.5398 8.83009C31.5398 7.55009 31.8198 6.35009 32.3398 5.27009C30.1398 4.81009 27.5798 4.59009 24.6198 4.59009C10.1998 4.59009 5.07983 9.69009 5.07983 24.1301C5.07983 38.5701 10.1998 43.6701 24.6198 43.6701C39.0598 43.6701 44.1798 38.5701 44.1798 24.1301C44.1798 21.2301 43.9798 18.7101 43.5398 16.5501Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M40.0398 13.3301C40.8798 13.3301 41.6798 13.0901 42.3398 12.6901C43.6398 11.9101 44.5198 10.4701 44.5198 8.83008C44.5198 6.35008 42.5198 4.33008 40.0398 4.33008C38.4198 4.33008 36.9998 5.19008 36.1998 6.49008C35.7798 7.17008 35.5398 7.97008 35.5398 8.83008C35.5398 11.3101 37.5598 13.3301 40.0398 13.3301Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Прототипирование')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M21.5689 32.4883H8.62292C7.51892 32.4883 6.62292 33.3823 6.62292 34.4883C6.62292 35.5943 7.51892 36.4883 8.62292 36.4883H21.5689C22.6729 36.4883 23.5689 35.5943 23.5689 34.4883C23.5689 33.3823 22.6729 32.4883 21.5689 32.4883Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M35.1344 28.0469C30.4984 28.0469 28.6904 29.8529 28.6904 34.4909C28.6904 39.1289 30.4984 40.9349 35.1344 40.9349C39.7724 40.9349 41.5784 39.1289 41.5784 34.4909C41.5784 29.8529 39.7724 28.0469 35.1344 28.0469Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M40.5766 11.5099H27.6346C26.5306 11.5099 25.6346 12.4039 25.6346 13.5099C25.6346 14.6159 26.5306 15.5099 27.6346 15.5099H40.5766C41.6806 15.5099 42.5766 14.6159 42.5766 13.5099C42.5766 12.4039 41.6806 11.5099 40.5766 11.5099Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M14.067 19.9531C18.705 19.9531 20.511 18.1471 20.511 13.5071C20.511 8.87106 18.705 7.06506 14.067 7.06506C9.42905 7.06506 7.62305 8.87106 7.62305 13.5071C7.62305 18.1471 9.42905 19.9531 14.067 19.9531Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Графический дизайн')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M39.617 37.4956H26.863C26.035 37.4956 25.363 38.1676 25.363 38.9956C25.363 39.8236 26.035 40.4956 26.863 40.4956H39.617C40.445 40.4956 41.117 39.8236 41.117 38.9956C41.117 38.1676 40.445 37.4956 39.617 37.4956Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M19.1333 15.4787C19.3322 15.2142 19.7077 15.1607 19.9726 15.3591L30.3325 23.1199C30.5979 23.3187 30.6517 23.6951 30.4526 23.9603L20.8132 36.8C18.4932 39.9 14.9932 40.52 12.5732 40.52C11.0732 40.52 9.99323 40.28 9.87323 40.26C9.61323 40.2 9.37323 40.02 9.23323 39.78C9.09323 39.52 5.65323 33.4 9.49323 28.3L19.1333 15.4787Z"
                fill="#246FFF"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M34.3132 18.82L32.9732 20.6014C32.7743 20.8659 32.3988 20.9194 32.134 20.721L21.7724 12.9589C21.5076 12.7605 21.4533 12.3853 21.6511 12.12L22.9932 10.32C24.3732 8.45998 26.5132 7.47998 28.6732 7.47998C30.1532 7.47998 31.6332 7.93998 32.9132 8.89998C34.4132 10.04 35.3932 11.7 35.6732 13.56C35.9332 15.44 35.4532 17.3 34.3132 18.82Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Разработка с нуля')"
          :class="{ 'col-span-2': $isMobile }"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                d="M39.28 13.08L33.1399 6.94C31.26 5.06 28.72 4 26.06 4H16.2C10.2 4 6.19995 8 6.19995 14V34C6.19995 40 10.2 44 16.2 44H32.2C38.2 44 42.2 40 42.2 34V20.14C42.2 17.48 41.14 14.94 39.28 13.08ZM20.26 34.94C20.84 35.52 20.84 36.48 20.26 37.06C19.96 37.36 19.58 37.5 19.2 37.5C18.82 37.5 18.44 37.36 18.14 37.06L14.14 33.06C13.56 32.48 13.56 31.52 14.14 30.94L18.14 26.94C18.72 26.36 19.68 26.36 20.26 26.94C20.84 27.52 20.84 28.48 20.26 29.06L17.32 32L20.26 34.94ZM34.26 33.06L30.26 37.06C29.96 37.36 29.58 37.5 29.2 37.5C28.82 37.5 28.44 37.36 28.14 37.06C27.56 36.48 27.56 35.52 28.14 34.94L31.08 32L28.14 29.06C27.56 28.48 27.56 27.52 28.14 26.94C28.72 26.36 29.68 26.36 30.26 26.94L34.26 30.94C34.84 31.52 34.84 32.48 34.26 33.06Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
      </div>
      <svg
        v-if="!$isMobile"
        class="w-full lg:max-w-[1400px] md:max-w-[1200px] sm:max-w-[700px]"
        width="1400"
        height="82"
        viewBox="0 0 1500 82"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M1361 40L139 40" stroke="#5C77BB" stroke-width="3" />
        <path d="M445 0V40" stroke="#5C77BB" stroke-width="3" />
        <path d="M762 0V40" stroke="#5C77BB" stroke-width="3" />
        <path
          d="M760.939 81.0607C761.525 81.6464 762.475 81.6464 763.061 81.0607L772.607 71.5147C773.192 70.9289 773.192 69.9792 772.607 69.3934C772.021 68.8076 771.071 68.8076 770.485 69.3934L762 77.8787L753.515 69.3934C752.929 68.8076 751.979 68.8076 751.393 69.3934C750.808 69.9792 750.808 70.9289 751.393 71.5147L760.939 81.0607ZM760.5 40V80H763.5V40H760.5Z"
          fill="#5C77BB"
        />
        <path d="M140 0V40" stroke="#5C77BB" stroke-width="3" />
        <path d="M1360 0V40" stroke="#5C77BB" stroke-width="3" />
        <path d="M1055 0V40" stroke="#5C77BB" stroke-width="3" />
      </svg>

      <!-- Centered Logo with Arrows -->
      <div class="flex justify-center py-10 sm:py-0 items-center mx-auto">
        <img
          src="~assets/images/logo.png"
          alt="WEBASE Logo"
          class="object-contain"
        />
      </div>

      <!-- Bottom Row of Cards -->
      <svg
        v-if="!$isMobile"
        class="w-full lg:max-w-[1400px] md:max-w-[1200px] sm:max-w-[700px]"
        width="1400"
        height="82"
        viewBox="0 0 1500 82"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M1361 42L139 42" stroke="#5C77BB" stroke-width="3" />
        <path d="M445 82V42" stroke="#5C77BB" stroke-width="3" />
        <path d="M762 82V42" stroke="#5C77BB" stroke-width="3" />
        <path
          d="M760.939 0.939339C761.525 0.353554 762.475 0.353554 763.061 0.939339L772.607 10.4853C773.192 11.0711 773.192 12.0208 772.607 12.6066C772.021 13.1924 771.071 13.1924 770.485 12.6066L762 4.12132L753.515 12.6066C752.929 13.1924 751.979 13.1924 751.393 12.6066C750.808 12.0208 750.808 11.0711 751.393 10.4853L760.939 0.939339ZM760.5 42V2H763.5V42H760.5Z"
          fill="#5C77BB"
        />
        <path d="M140 82V42" stroke="#5C77BB" stroke-width="3" />
        <path d="M1360 82V42" stroke="#5C77BB" stroke-width="3" />
        <path d="M1055 82V42" stroke="#5C77BB" stroke-width="3" />
      </svg>

      <div class="grid grid-cols-2 md:grid-cols-5 gap-6">
        <ProcessCard
          :class="{ 'col-span-2': $isMobile }"
          :title="t('Разработка мобильных проектов')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                d="M32.48 4H15.52C10 4 8 6 8 11.62V36.38C8 42 10 44 15.52 44H32.46C38 44 40 42 40 36.38V11.62C40 6 38 4 32.48 4ZM24 38.6C22.08 38.6 20.5 37.02 20.5 35.1C20.5 33.18 22.08 31.6 24 31.6C25.92 31.6 27.5 33.18 27.5 35.1C27.5 37.02 25.92 38.6 24 38.6ZM28 12.5H20C19.18 12.5 18.5 11.82 18.5 11C18.5 10.18 19.18 9.5 20 9.5H28C28.82 9.5 29.5 10.18 29.5 11C29.5 11.82 28.82 12.5 28 12.5Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Костамизация готовых решений')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                d="M39.44 4H10.16C7.22005 4 4.80005 6.42 4.80005 9.36V14.62C4.80005 17.58 7.22005 20 10.16 20H39.42C42.38 20 44.8 17.58 44.8 14.64V9.36C44.8 6.42 42.38 4 39.44 4ZM14.3 14C14.3 14.82 13.62 15.5 12.8 15.5C11.98 15.5 11.3 14.82 11.3 14V10C11.3 9.18 11.98 8.5 12.8 8.5C13.62 8.5 14.3 9.18 14.3 10V14ZM22.3 14C22.3 14.82 21.62 15.5 20.8 15.5C19.98 15.5 19.3 14.82 19.3 14V10C19.3 9.18 19.98 8.5 20.8 8.5C21.62 8.5 22.3 9.18 22.3 10V14ZM36.8 13.5H28.8C27.98 13.5 27.3 12.82 27.3 12C27.3 11.18 27.98 10.5 28.8 10.5H36.8C37.62 10.5 38.3 11.18 38.3 12C38.3 12.82 37.62 13.5 36.8 13.5Z"
                fill="#246FFF"
              />
              <path
                d="M39.44 28H10.16C7.22005 28 4.80005 30.42 4.80005 33.36V38.62C4.80005 41.58 7.22005 44 10.16 44H39.42C42.38 44 44.78 41.58 44.78 38.64V33.38C44.8 30.42 42.38 28 39.44 28ZM14.3 38C14.3 38.82 13.62 39.5 12.8 39.5C11.98 39.5 11.3 38.82 11.3 38V34C11.3 33.18 11.98 32.5 12.8 32.5C13.62 32.5 14.3 33.18 14.3 34V38ZM22.3 38C22.3 38.82 21.62 39.5 20.8 39.5C19.98 39.5 19.3 38.82 19.3 38V34C19.3 33.18 19.98 32.5 20.8 32.5C21.62 32.5 22.3 33.18 22.3 34V38ZM36.8 37.5H28.8C27.98 37.5 27.3 36.82 27.3 36C27.3 35.18 27.98 34.5 28.8 34.5H36.8C37.62 34.5 38.3 35.18 38.3 36C38.3 36.82 37.62 37.5 36.8 37.5Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Функциональное усовершенствование')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                d="M34.6 45.5H14.6C13.78 45.5 13.1 44.82 13.1 44C13.1 43.18 13.78 42.5 14.6 42.5H34.6C35.42 42.5 36.1 43.18 36.1 44C36.1 44.82 35.42 45.5 34.6 45.5Z"
                fill="#246FFF"
              />
              <path
                d="M36.6 4H12.6C8.17998 4 4.59998 7.58 4.59998 12V30C4.59998 34.42 8.17998 38 12.6 38H36.6C41.02 38 44.6 34.42 44.6 30V12C44.6 7.58 41.02 4 36.6 4ZM20.58 14.64C21.7 14.64 22.6 15.54 22.6 16.64C22.6 17.74 21.7 18.64 20.6 18.64C19.5 18.64 18.6 17.74 18.6 16.64C18.6 15.54 19.48 14.64 20.58 14.64ZM14.28 14.64C15.4 14.64 16.3 15.54 16.3 16.64C16.3 17.74 15.4 18.64 14.3 18.64C13.2 18.64 12.3 17.74 12.3 16.64C12.3 15.54 13.16 14.64 14.28 14.64ZM35.12 29.72H14.12C13.28 29.72 12.6 29.04 12.6 28.22C12.6 27.4 13.26 26.72 14.08 26.72H35.14C35.96 26.72 36.64 27.4 36.64 28.22C36.64 29.04 35.96 29.72 35.12 29.72ZM35.12 18.14H27.76C26.94 18.14 26.26 17.46 26.26 16.64C26.26 15.82 26.94 15.14 27.76 15.14H35.12C35.94 15.14 36.62 15.82 36.62 16.64C36.62 17.46 35.96 18.14 35.12 18.14Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Миграция приложений и данных')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                d="M18.3997 28.4399H8.2397C7.0197 28.4399 5.8997 29.0599 5.2597 30.0999C4.6197 31.1199 4.5597 32.3399 5.0797 33.4199C7.5397 38.4599 11.9797 42.4199 17.2597 44.2799C17.6197 44.3999 18.0197 44.4799 18.3997 44.4799C19.0997 44.4799 19.7997 44.2599 20.3997 43.8399C21.3397 43.1799 21.8997 42.0999 21.8997 40.9599L21.9197 31.9599C21.9197 31.0199 21.5597 30.1399 20.8997 29.4799C20.2197 28.8199 19.3397 28.4399 18.3997 28.4399Z"
                fill="#246FFF"
              />
              <path
                d="M45.3599 19.2C43.1199 9.36 34.4999 2.5 24.3999 2.5C14.2999 2.5 5.67994 9.36 3.43994 19.2C3.19994 20.24 3.43994 21.3 4.11994 22.14C4.79994 22.98 5.79994 23.46 6.87994 23.46H41.9399C43.0199 23.46 44.0199 22.98 44.6999 22.14C45.3599 21.3 45.5999 20.22 45.3599 19.2Z"
                fill="#246FFF"
              />
              <path
                d="M40.52 28.54L30.4 28.52C29.46 28.52 28.58 28.88 27.92 29.54C27.26 30.2 26.9 31.08 26.9 32.02L26.92 40.98C26.92 42.12 27.48 43.2 28.42 43.86C29.02 44.28 29.72 44.5 30.42 44.5C30.8 44.5 31.18 44.44 31.54 44.3C36.78 42.46 41.22 38.52 43.68 33.54C44.2 32.48 44.14 31.24 43.52 30.24C42.86 29.16 41.74 28.54 40.52 28.54Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
        <ProcessCard
          :title="t('Сопровождение и поддержка')"
          :description="
            t('Вне зависимости от типа и технологической сложности решения')
          "
        >
          <template #icon>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-[24px] h-[24px] sm:w-[48px] sm:h-[48px]"
              viewBox="0 0 48 48"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M24.1997 30C20.8917 30 18.1997 27.308 18.1997 24C18.1997 20.692 20.8917 18 24.1997 18C27.5077 18 30.1997 20.692 30.1997 24C30.1997 27.308 27.5077 30 24.1997 30ZM39.2277 25.828C38.5737 25.446 38.1817 24.764 38.1817 24C38.1817 23.236 38.5737 22.554 39.2297 22.174C42.0657 20.524 43.0397 16.86 41.4037 14.002C40.6057 12.614 39.3197 11.622 37.7797 11.208C36.2477 10.802 34.6477 11.014 33.2757 11.812C32.6277 12.192 31.8537 12.192 31.2017 11.814C30.5417 11.436 30.1477 10.75 30.1477 9.984C30.1477 6.686 27.4797 4 24.1997 4C20.9177 4 18.2497 6.686 18.2497 9.984C18.2497 10.752 17.8557 11.436 17.1957 11.816C16.5477 12.188 15.7737 12.192 15.1257 11.812C13.7497 11.014 12.1517 10.798 10.6157 11.21C9.07573 11.624 7.79173 12.616 6.99573 14.004C5.35973 16.862 6.33573 20.526 9.17173 22.172C9.82573 22.552 10.2157 23.236 10.2157 24C10.2157 24.764 9.82573 25.448 9.17173 25.826C6.33573 27.476 5.35973 31.142 6.99573 33.998C7.79173 35.384 9.07573 36.376 10.6137 36.79C12.1477 37.2 13.7497 36.988 15.1257 36.19C15.7717 35.81 16.5457 35.81 17.1957 36.184C17.8557 36.564 18.2497 37.248 18.2497 38.016C18.2497 41.314 20.9177 44 24.1997 44C27.4797 44 30.1477 41.314 30.1477 38.016C30.1477 37.25 30.5417 36.564 31.2017 36.186C31.8517 35.81 32.6257 35.81 33.2757 36.19C34.6497 36.988 36.2497 37.196 37.7797 36.792C39.3197 36.378 40.6057 35.386 41.4037 33.998C43.0397 31.142 42.0657 27.478 39.2277 25.828Z"
                fill="#246FFF"
              />
            </svg>
          </template>
        </ProcessCard>
      </div>
    </div>

    <!-- Call to Action Button -->
    <div class="flex justify-center mt-8">
      <button
        @click="scrollToSection('#contacts')"
        class="flex px-[32px] py-[17px] bg-black text-white rounded-full text-[16px] transition duration-300 ease-in-out hover:bg-[#246FFF]"
      >
        {{ t("Оставьте заявку") }}
        <svg
          class=""
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
        >
          <path
            d="M19.999 12L3.99926 12"
            stroke="white"
            stroke-width="1.5"
            stroke-linecap="square"
          />
          <path
            d="M14.3394 17.66C14.3394 14.7503 16.9019 12 19.9994 12"
            stroke="white"
            stroke-width="1.5"
            stroke-linecap="square"
          />
          <path
            d="M14.3394 6.33995C14.3394 9.2497 16.9019 12 19.9994 12"
            stroke="white"
            stroke-width="1.5"
            stroke-linecap="square"
          />
        </svg>
      </button>
    </div>
  </div>
</template>
<script setup lang="ts">
import { useI18n } from "vue-i18n";
const { t } = useI18n();
const { $isMobile } = useNuxtApp();

function scrollToSection(sectionId: any) {
  const section = document.querySelector(sectionId);
  if (section) {
    section.scrollIntoView({ behavior: "smooth" });
  }
}
</script>
