{
  "about": "About Us",
  "portfolio": "Portfolio",
  "why_us": "Why Choose Us?",
  "development_cycle": "Development Cycle",
  "contacts": "Contacts",
  "work": "Start Working",
  "Вне зависимости от типа и технологической сложности решения, мы обеспечим качественную реализацию функциональности, высокую доступность и производительность системы, а также привлекательный дизайн и безупречное удобство пользования.": "Regardless of the type and technological complexity of the solution, we ensure high-quality implementation of functionality, high availability and system performance, as well as attractive design and flawless user convenience.",
  "Связаться с нами": "Contact Us",
  "Номер телефона": "Phone Number",
  "Электронный адрес": "Email Address",
  "Адрес": "Address",
  "Имя": "Name",
  "Введите ваше имя": "Enter your name",
  "Адрес электронной почты": "Email Address",
  "Введите ваш email": "Enter your email",
  "Тема": "Subject",
  "Введите тему": "Enter the subject",
  "Введите ваше сообщение": "Enter your message",
  "Я принимаю условия и положения отправки заявки": "I accept the terms and conditions of submitting the application",
  "Оставьте заявку": "Submit a Request",
  "IT-компания в Ташкенте": "IT Company in Tashkent",
  "Form submitted successfully!": "Form submitted successfully!",
  "Наши социальные сети:": "Our Social Media:",
  "Instagram": "Instagram",
  "Facebook": "Facebook",
  "Tiktok": "Tiktok",
  "LinkedIn": "LinkedIn",
  "YouTube": "YouTube",
  "Behance": "Behance",
  "Наш адрес:": "Our Address:",
  "Your browser does not support the video tag.": "Your browser does not support the video tag.",
  "ДАВАЙТЕ РАЗРАБОТАЕМ ПЛАН И ДОБЬЕМСЯ РЕАЛЬНЫХ РЕЗУЛЬТАТОВ.": "LET'S CREATE A PLAN AND ACHIEVE REAL RESULTS.",
  "ДАВАЙТЕ СДЕЛАЕМ ЭТО ПО-КРУПНОМУ": "LET'S DO IT BIG",
  "Вернуться к началу": "Return to the top",
  "Все права защищены": "All rights reserved",
  "Опережайте события благодаря нашему перспективному мышлению.": "Stay ahead of the curve with our forward-thinking approach.",
  "Посмотреть наши кейсы": "View Our Cases",
  "Доверяют крупнейшие мировые бренды": "Trusted by the World's Leading Brands",
  "Наши услуги и кейсы": "Our Services and Cases",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования. Это обеспечивает быстрый старт проекта, сокращение сроков работ и бюджета на разработку информационного продукта.": "In collaboration with you, we create software products whose functionality fully meets the unique needs of your business and service characteristics. Our accumulated experience, expertise, and knowledge in custom software development allow us to select optimal technical solutions and promptly gather requirements. This ensures a quick project start, reduced timelines, and minimized budgets for software product development.",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования.": "In collaboration with you, we create a software product whose functional capabilities fully meet the unique needs of your business and the specifics of your services. The accumulated experience, expertise, and knowledge in custom software development allow us to choose optimal technical solutions and promptly gather requirements.",
  "Кратчайшие сроки": "Shortest Deadlines",
  "Нашим клиентам мы обеспечиваем полный контроль и прозрачность операций, а также гарантируем результаты точно в срок и в ожидаемом объеме.": "We provide our clients with full control and transparency of operations, as well as guarantee results exactly on time and in the expected scope.",
  "Высокий уровень производительности": "High Level of Performance",
  "Исправляем алгоритмы, оптимизируем производительность и повышаем стабильность.": "We fix algorithms, optimize performance, and enhance stability.",
  "Интуитивный интерфейс пользователя": "Intuitive User Interface",
  "Создание удобного пользовательского интерфейса, который повысит степень удовлетворенности пользователей.": "Creating a user-friendly interface that will increase user satisfaction.",
  "Все": "All",
  "ИТ-консалтинг": "IT Consulting",
  "Прототипирование": "Prototyping",
  "Заказная разработка ПО": "Custom Software Development",
  "Виртуализация": "Virtualization",
  "Независимое тестирование": "Independent Testing",
  "Информационная безопасность": "Information Security",
  "Сопровождение и поддержка": "Maintenance and Support",
  "Миграция ПО": "Software Migration",
  "Интеграция приложений": "Application Integration",
  "texnomed": "texnomed",
  "ombudsman": "ombudsman",
  "shotfaktura": "shotfaktura",
  "project": "project",
  "Обеспечьте лучший сервис, используя нестандартные идеи": "Deliver better service using unconventional ideas",
  "Webase действительно является крупной IT-компанией. Она активно работает в сфере информационных технологий и предоставляет различные услуги и решения для бизнеса. В последние годы компания значительно расширила свои масштабы и укрепила свои позиции на рынке, что подтверждается её включением в различные рейтинги IT-компаний.": "Webase is truly a major IT company. It actively operates in the field of information technology and provides various services and solutions for businesses. In recent years, the company has significantly expanded its scale and strengthened its market position, as evidenced by its inclusion in various IT company rankings.",
  "Проект завершен великолепно": "The project was completed magnificently",
  "КАК МЫ РАБОТАЕМ": "HOW WE WORK",
  "Обеспечиваем прозрачное управление процессами разработки ПО": "We provide transparent management of software development processes",
  "Работаем в рамках единой команды": "We work as a single team",
  "Проводим еженедельные встречи по статусу задач проекта, расставляем приоритеты и обсуждаем результаты нашей работы.": "We hold weekly meetings on the status of project tasks, prioritize, and discuss the results of our work.",
  "Совместно планируем сроки и бюджеты": "We jointly plan deadlines and budgets",
  "Внимательно изучив потребности Вашего проекта, мы подберем оптимальное решение, которое подойдет обеим сторонам.": "After carefully studying your project's needs, we will select the best solution that suits both parties.",
  "Полный цикл разработки": "Full Development Cycle",
  "Консалтинг": "Consulting",
  "Вне зависимости от типа и технологической сложности решения": "Regardless of the type and technological complexity of the solution",
  "Бизнес-анализ": "Business Analysis",
  "Графический дизайн": "Graphic Design",
  "Разработка с нуля": "Development from Scratch",
  "Разработка мобильных проектов": "Mobile Project Development",
  "Костамизация готовых решений": "Customization of Ready-Made Solutions",
  "Функциональное усовершенствование": "Functional Improvement",
  "Миграция приложений и данных": "Application and Data Migration",
  "Крупные компании, с которыми мы работаем и которые нам очень доверяют": "Large companies we work with and highly trust us",
  "Увеличивайте трафик и продажи": "Increase Traffic and Sales",
  "Увеличивайте трафик и продажи продукции": "Boost Traffic and Product Sales",
  "Почему выбрали нас?": "Why Choose Us?",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг.": "In collaboration with you, we create a software product whose functionality fully meets the unique needs of your business and service specifics.",
  "Квалифицированная работа, умные решения": "Qualified Work, Smart Solutions",
  "Мы создаем новые корпоративные системы, компоненты и приложения любой сложности и масштаба, в том числе разрабатываем системы внутренней автоматизации Ваших бизнес процессов.": "We create new corporate systems, components, and applications of any complexity and scale, including the development of internal automation systems for your business processes.",
  "Эксклюзивность": "Exclusivity",
  "Специальная команда разработчиков полностью погружается в проект клиента, подстраиваясь под его бизнес-процессы и требования с учетом отраслевых особенностей компании заказчика.": "A dedicated team of developers fully immerses in the client's project, adapting to its business processes and requirements, considering the industry-specific features of the customer's company.",
  "Оптимизация затрат": "Cost Optimization",
  "Сотрудничая с профессиональным поставщиком услуг по разработке программного обеспечения, вы не несете затрат на поиск, привлечение и подготовку собственной ИТ-команды.": "By cooperating with a professional software development service provider, you avoid costs associated with searching, attracting, and training your own IT team.",
  "Клиенты": "Clients",
  "Проекты": "Projects",
  "Лет на рынке разработки программного обеспечения": "Years in the Software Development Market",
  "Трудоголики": "Workaholics"
}
