{
  "about": "Биз ҳақимизда",
  "portfolio": "Портфолио",
  "why_us": "Нега бизни танлашди?",
  "development_cycle": "Ривожланиш цикли",
  "contacts": "Алоқа",
  "work": "Ишни бошлаш",
  "Вне зависимости от типа и технологической сложности решения, мы обеспечим качественную реализацию функциональности, высокую доступность и производительность системы, а также привлекательный дизайн и безупречное удобство пользования.": "Қандай турдаги ва қанчалик мураккаб бўлишидан қатъи назар, биз функциялликни сифатли амалга оширишни, тизимнинг юқори мавжудлигини ва унумдорлигини, шунингдек, жозибадор дизайн ва фойдаланиш қулайлигини таъминлаймиз.",
  "Связаться с нами": "Биз билан боғланинг",
  "Номер телефона": "Телефон рақам",
  "Электронный адрес": "Электрон почта",
  "Адрес": "Манзил",
  "Имя": "Исм",
  "Введите ваше имя": "Исмингизни киритинг",
  "Адрес электронной почты": "Электрон почта манзили",
  "Введите ваш email": "Emailингизни киритинг",
  "Тема": "Мавзу",
  "Введите тему": "Мавзуни киритинг",
  "Введите ваше сообщение": "Хабарингизни киритинг",
  "Я принимаю условия и положения отправки заявки": "Мен ариза топшириш шартларини қабул қиламан",
  "Оставьте заявку": "Ариза қолдириш",
  "IT-компания в Ташкенте": "Тошкентдаги IT компания",
  "Form submitted successfully!": "Ариза муваффақиятли юборилди!",
  "Наши социальные сети:": "Бизнинг ижтимоий тармоқларимиз:",
  "Instagram": "Instagram",
  "Facebook": "Facebook",
  "Tiktok": "Tiktok",
  "LinkedIn": "LinkedIn",
  "YouTube": "YouTube",
  "Behance": "Behance",
  "Наш адрес:": "Бизнинг манзилимиз:",
  "Your browser does not support the video tag.": "Браузерингиз видео теги форматига мос эмас.",
  "ДАВАЙТЕ РАЗРАБОТАЕМ ПЛАН И ДОБЬЕМСЯ РЕАЛЬНЫХ РЕЗУЛЬТАТОВ.": "Келинг, режа тузамиз ва ҳақиқий натижаларга эришамиз.",
  "ДАВАЙТЕ СДЕЛАЕМ ЭТО ПО-КРУПНОМУ": "Келинг, бунга катта кўламда киришамиз.",
  "Вернуться к началу": "Бош саҳифага қайтиш",
  "Все права защищены": "Барча ҳуқуқлар ҳимояланган",
  "Опережайте события благодаря нашему перспективному мышлению.": "Бизнинг илғор фикрлашимиз билан олдинга юксалинг.",
  "Посмотреть наши кейсы": "Бизнинг ишларимизни кўринг",
  "Доверяют крупнейшие мировые бренды": "Дунё етакчи брендлари ишонади",
  "Наши услуги и кейсы": "Бизнинг хизматларимиз ва ишларимиз",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования. Это обеспечивает быстрый старт проекта, сокращение сроков работ и бюджета на разработку информационного продукта.": "Сиз билан ҳамкорликда биз бизнесингизнинг ўзига хос эҳтиёжлари ва хизмат хусусиятларига мос келадиган дастурий маҳсулот яратамиз. Тўпланган тажриба, экспертлик ва буюртма асосида дастурий таъминот ишлаб чиқариш бўйича билимлар бизга оптимал техник ечимларни танлаш ва талабларни тезда йиғишга имкон беради. Бу лойиҳа бошланишининг тезкорлигини, иш муддатини қисқартиришни ва дастурий маҳсулотни ишлаб чиқариш бюджети қисқаришини таъминлайди.",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования.": "Сиз билан ҳамкорликда биз дастурий маҳсулот яратамиз, унинг функционал имкониятлари сизнинг бизнесингизнинг ноёб эҳтиёжларига ва хизматларингиз хусусиятларига тўлиқ жавоб беради. Тўпланган тажриба, эксперт ва буюртма асосида дастурий таъминот ишлаб чиқиш бўйича билимларимиз бизга оптимал техник ечимларни танлаш ва талабларни тезда йиғиш имконини беради.",
  "Кратчайшие сроки": "Энг қисқа муддатлар",
  "Нашим клиентам мы обеспечиваем полный контроль и прозрачность операций, а также гарантируем результаты точно в срок и в ожидаемом объеме.": "Биз мижозларимизга тўлиқ назорат ва жараёнларнинг шаффофлигини таъминлаймиз, шунингдек натижаларни ўз вақтида ва кутилган ҳажмда кафолатлаймиз.",
  "Высокий уровень производительности": "Юқори унумдорлик даражаси",
  "Исправляем алгоритмы, оптимизируем производительность и повышаем стабильность.": "Биз алгоритмларни тузатамиз, унумдорликни оптималлаштирамиз ва барқарорликни оширамиз.",
  "Интуитивный интерфейс пользователя": "Интуитив фойдаланувчи интерфейси",
  "Создание удобного пользовательского интерфейса, который повысит степень удовлетворенности пользователей.": "Фойдаланувчилар қониқишини оширадиган қулай фойдаланувчи интерфейсини яратиш.",
  "Все": "Барчаси",
  "ИТ-консалтинг": "IT Консалтинг",
  "Прототипирование": "Прототиплаш",
  "Заказная разработка ПО": "Махсус дастурий таъминот ишлаб чиқиш",
  "Виртуализация": "Виртуализация",
  "Независимое тестирование": "Мустақил синов",
  "Информационная безопасность": "Ахборот хавфсизлиги",
  "Сопровождение и поддержка": "Қўллаб-қувватлаш ва техник хизмат кўрсатиш",
  "Миграция ПО": "Дастурий таъминотни кўчириш",
  "Интеграция приложений": "Иловаларни интеграция қилиш",
  "texnomed": "ТехноМед",
  "ombudsman": "Омбудсман",
  "shotfaktura": "Шотфактура",
  "project": "Лойиҳа",
  "Обеспечьте лучший сервис, используя нестандартные идеи": "Нодатий ғоялар ёрдамида энг яхши хизматни таъминланг",
  "Webase действительно является крупной IT-компанией. Она активно работает в сфере информационных технологий и предоставляет различные услуги и решения для бизнеса. В последние годы компания значительно расширила свои масштабы и укрепила свои позиции на рынке, что подтверждается её включением в различные рейтинги IT-компаний.": "Webase ҳақиқатда йирик IT компания. У ахборот технологиялари соҳасида фаолият юритади ва бизнес учун турли хизматлар ва ечимлар тақдим этади. Сўнгги йилларда компания ўз ҳажмини сезиларли даражада кенгайтирди ва бозор позициясини мустаҳкамлади, бу унинг турли IT-компания рейтингларига киритилиши билан тасдиқланади.",
  "Проект завершен великолепно": "Лойиҳа ажойиб тарзда якунланди",
  "КАК МЫ РАБОТАЕМ": "ҚАНДАЙ ИШЛАЙМИЗ",
  "Обеспечиваем прозрачное управление процессами разработки ПО": "Дастурий таъминот ишлаб чиқиш жараёнларини шаффоф бошқаришни таъминлаймиз",
  "Работаем в рамках единой команды": "Ягона жамоа сифатида ишлаймиз",
  "Проводим еженедельные встречи по статусу задач проекта, расставляем приоритеты и обсуждаем результаты нашей работы.": "Ҳар ҳафта лойиҳа вазифаларининг ҳолати бўйича учрашувлар ўтказамиз, устуворликларни белгилаймиз ва иш натижаларини муҳокама қиламиз.",
  "Совместно планируем сроки и бюджеты": "Муддатлар ва бюджетларни биргаликда режалаштирамиз",
  "Внимательно изучив потребности Вашего проекта, мы подберем оптимальное решение, которое подойдет обеим сторонам.": "Лойиҳангиз эҳтиёжларини синчиклаб ўрганган ҳолда, иккала томонга мос келадиган оптимал ечимни танлаймиз.",
  "Полный цикл разработки": "Тўлиқ ривожлантириш цикли",
  "Консалтинг": "Консалтинг",
  "Вне зависимости от типа и технологической сложности решения": "Ечим тури ва технологик мураккаблигидан қатъи назар",
  "Бизнес-анализ": "Бизнес таҳлил",
  "Графический дизайн": "График дизайн",
  "Разработка с нуля": "Нолдан ривожлантириш",
  "Разработка мобильных проектов": "Мобил лойиҳаларни ишлаб чиқиш",
  "Костамизация готовых решений": "Тайёр ечимларни мослаштириш",
  "Функциональное усовершенствование": "Функционал такомиллаштириш",
  "Миграция приложений и данных": "Иловалар ва маълумотларни кўчириш",
  "Крупные компании, с которыми мы работаем и которые нам очень доверяют": "Биз ишлаётган ва бизга ишонадиган йирик компаниялар",
  "Увеличивайте трафик и продажи": "Трафик ва савдоларни оширинг",
  "Увеличивайте трафик и продажи продукции": "Маҳсулотлар трафиги ва савдосини оширинг",
  "Почему выбрали нас?": "Нега бизни танлайсиз?",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг.": "Бизнесингизнинг ўзига хос эҳтиёжлари ва хизмат хусусиятларига мос дастурий маҳсулот яратамиз.",
  "Квалифицированная работа, умные решения": "Малакасиз иш, ақлли ечимлар",
  "Мы создаем новые корпоративные системы, компоненты и приложения любой сложности и масштаба, в том числе разрабатываем системы внутренней автоматизации Ваших бизнес процессов.": "Биз янги корпоратив тизимлар, компонентлар ва ҳар қандай мураккабликдаги иловаларни яратамиз, шу жумладан бизнес жараёнларингизни автоматлаштириш тизимларини ишлаб чиқамиз.",
  "Эксклюзивность": "Эксклюзивлик",
  "Специальная команда разработчиков полностью погружается в проект клиента, подстраиваясь под его бизнес-процессы и требования с учетом отраслевых особенностей компании заказчика.": "Махсус дастурчилар жамоаси мижознинг бизнес жараёнлари ва талабларига мослашиб, лойиҳага тўлиқ шўнғийди.",
  "Оптимизация затрат": "Харажатларни оптималлаштириш",
  "Сотрудничая с профессиональным поставщиком услуг по разработке программного обеспечения, вы не несете затрат на поиск, привлечение и подготовку собственной ИТ-команды.": "Профессионал дастурий таъминот хизматларини тақдим этувчи етказиб берувчи билан ҳамкорлик қилган ҳолда, ўзингизнинг IT-жамоангизни излаш, жалб қилиш ва тайёрлаш бўйича харажатларни сезиларли даражада камайтиришингиз мумкин.",
  "Клиенты": "Мижозлар",
  "Проекты": "Лойиҳалар",
  "Лет на рынке разработки программного обеспечения": "Йиллар дастурий таъминот бозорида",
  "Трудоголики": "Меҳнатсеварлар"
}
