{
  "about": "Biz haqimizda",
  "portfolio": "Portfolio",
  "why_us": "Nega bizni tanlashdi?",
  "development_cycle": "Rivojlanish tsikli",
  "contacts": "Aloqa",
  "work": "Ishni boshlash",
  "Вне зависимости от типа и технологической сложности решения, мы обеспечим качественную реализацию функциональности, высокую доступность и производительность системы, а также привлекательный дизайн и безупречное удобство пользования.": "Qanday turdagi va qanchalik murakkab bo'lishidan qat'i nazar, biz funksionallikni sifatli amalga oshirishni, tizimning yuqori mavjudligini va unumdorligini, shuningdek, jozibador dizayn va foydalanish qulayligini ta'minlaymiz.",
  "Связаться с нами": "Biz bilan bog'laning",
  "Номер телефона": "Telefon raqam",
  "Электронный адрес": "Elektron pochta",
  "Адрес": "Manzil",
  "Имя": "Ism",
  "Введите ваше имя": "Ismingizni kiriting",
  "Адрес электронной почты": "Elektron pochta manzili",
  "Введите ваш email": "Emailingizni kiriting",
  "Тема": "Mavzu",
  "Введите тему": "Mavzuni kiriting",
  "Введите ваше сообщение": "Xabaringizni kiriting",
  "Я принимаю условия и положения отправки заявки": "Men ariza topshirish shartlarini qabul qilaman",
  "Оставьте заявку": "Ariza qoldirish",
  "IT-компания в Ташкенте": "Toshkentdagi IT kompaniya",
  "Form submitted successfully!": "Ariza muvaffaqiyatli yuborildi!",
  "Наши социальные сети:": "Bizning ijtimoiy tarmoqlarimiz:",
  "Instagram": "Instagram",
  "Facebook": "Facebook",
  "Tiktok": "Tiktok",
  "LinkedIn": "LinkedIn",
  "YouTube": "YouTube",
  "Behance": "Behance",
  "Наш адрес:": "Bizning manzilimiz:",
  "Your browser does not support the video tag.": "Brauzeringiz video tegi formatini qo'llab-quvvatlamaydi.",
  "ДАВАЙТЕ РАЗРАБОТАЕМ ПЛАН И ДОБЬЕМСЯ РЕАЛЬНЫХ РЕЗУЛЬТАТОВ.": "Keling, reja tuzamiz va haqiqiy natijalarga erishamiz.",
  "ДАВАЙТЕ СДЕЛАЕМ ЭТО ПО-КРУПНОМУ": "Keling, buni katta ko'lamda qilamiz.",
  "Вернуться к началу": "Bosh sahifaga qaytish",
  "Все права защищены": "Barcha huquqlar himoyalangan",
  "Опережайте события благодаря нашему перспективному мышлению.": "Bizning ilg'or fikrlashimiz orqali oldinga yuksaling.",
  "Посмотреть наши кейсы": "Bizning ishlarimizni ko'ring",
  "Доверяют крупнейшие мировые бренды": "Dunyoning yetakchi brendlari ishonadi",
  "Наши услуги и кейсы": "Bizning xizmatlarimiz va ishlarimiz",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования. Это обеспечивает быстрый старт проекта, сокращение сроков работ и бюджета на разработку информационного продукта.": "Siz bilan hamkorlikda biz biznesingizning o'ziga xos ehtiyojlari va xizmat xususiyatlariga mos keladigan dasturiy mahsulot yaratamiz. To'plangan tajriba, ekspertiza va buyurtma asosida dasturiy ta'minot ishlab chiqish bo'yicha bilimlar bizga optimal texnik yechimlarni tanlash va talablarni tezda yig'ishga imkon beradi. Bu loyiha boshlanishining tezkorligini, ish muddatini qisqartirishni va dasturiy mahsulotni ishlab chiqish byudjetini kamaytirishni ta'minlaydi.",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг. Накопленный опыт, экспертиза и знания в разработке программного обеспечения на заказ позволяют нам выбирать оптимальные технические решения и оперативно собирать требования.": "Siz bilan hamkorlikda biz dasturiy mahsulot yaratamiz, uning funksional imkoniyatlari sizning biznesingizning noyob ehtiyojlariga va xizmatlaringiz xususiyatlariga to‘liq javob beradi. To‘plangan tajriba, ekspertiza va buyurtma asosida dasturiy ta’minot ishlab chiqish bo‘yicha bilimlarimiz bizga optimal texnik yechimlarni tanlash va talablarni tezda yig‘ish imkonini beradi.",
  "Кратчайшие сроки": "Eng qisqa muddatlar",
  "Нашим клиентам мы обеспечиваем полный контроль и прозрачность операций, а также гарантируем результаты точно в срок и в ожидаемом объеме.": "Biz mijozlarimizga to'liq nazorat va jarayonlarning shaffofligini ta'minlaymiz, shuningdek natijalarni o'z vaqtida va kutilgan hajmda kafolatlaymiz.",
  "Высокий уровень производительности": "Yuqori unumdorlik darajasi",
  "Исправляем алгоритмы, оптимизируем производительность и повышаем стабильность.": "Biz algoritmlarni tuzatamiz, unumdorlikni optimallashtiramiz va barqarorlikni oshiramiz.",
  "Интуитивный интерфейс пользователя": "Intuitiv foydalanuvchi interfeysi",
  "Создание удобного пользовательского интерфейса, который повысит степень удовлетворенности пользователей.": "Foydalanuvchilar qoniqishini oshiradigan qulay foydalanuvchi interfeysini yaratish.",
  "Все": "Barchasi",
  "ИТ-консалтинг": "IT Konsalting",
  "Прототипирование": "Prototiplash",
  "Заказная разработка ПО": "Maxsus dasturiy ta'minot ishlab chiqish",
  "Виртуализация": "Virtualizatsiya",
  "Независимое тестирование": "Mustaqil sinov",
  "Информационная безопасность": "Axborot xavfsizligi",
  "Сопровождение и поддержка": "Qo'llab-quvvatlash va texnik xizmat ko'rsatish",
  "Миграция ПО": "Dasturiy ta'minotni ko'chirish",
  "Интеграция приложений": "Ilovalarni integratsiya qilish",
  "texnomed": "TexnoMed",
  "ombudsman": "Ombudsman",
  "shotfaktura": "Shotfaktura",
  "project": "Loyiha",
  "Обеспечьте лучший сервис, используя нестандартные идеи": "Noodatiy g'oyalar yordamida eng yaxshi xizmatni ta'minlang",
  "Webase действительно является крупной IT-компанией. Она активно работает в сфере информационных технологий и предоставляет различные услуги и решения для бизнеса. В последние годы компания значительно расширила свои масштабы и укрепила свои позиции на рынке, что подтверждается её включением в различные рейтинги IT-компаний.": "Webase haqiqatda yirik IT kompaniya. U axborot texnologiyalari sohasida faoliyat yuritadi va biznes uchun turli xizmatlar va yechimlar taqdim etadi. So'nggi yillarda kompaniya o'z hajmini sezilarli darajada kengaytirdi va bozor pozitsiyasini mustahkamladi, bu uning turli IT-kompaniya reytinglariga kiritilishi bilan tasdiqlanadi.",
  "Проект завершен великолепно": "Loyiha ajoyib tarzda yakunlandi",
  "КАК МЫ РАБОТАЕМ": "QANDAY ISHLAYMIZ",
  "Обеспечиваем прозрачное управление процессами разработки ПО": "Dasturiy ta'minot ishlab chiqish jarayonlarini shaffof boshqarishni ta'minlaymiz",
  "Работаем в рамках единой команды": "Yagona jamoa sifatida ishlaymiz",
  "Проводим еженедельные встречи по статусу задач проекта, расставляем приоритеты и обсуждаем результаты нашей работы.": "Har hafta loyiha vazifalarining holati bo'yicha uchrashuvlar o'tkazamiz, ustuvorliklarni belgilaymiz va ish natijalarini muhokama qilamiz.",
  "Совместно планируем сроки и бюджеты": "Muddatlar va byudjetlarni birgalikda rejalashtiramiz",
  "Внимательно изучив потребности Вашего проекта, мы подберем оптимальное решение, которое подойдет обеим сторонам.": "Loyihangiz ehtiyojlarini sinchiklab o'rgangan holda, ikkala tomonga mos keladigan optimal yechimni tanlaymiz.",
  "Полный цикл разработки": "To'liq rivojlantirish sikli",
  "Консалтинг": "Konsalting",
  "Вне зависимости от типа и технологической сложности решения": "Yechim turi va texnologik murakkabligidan qat'i nazar",
  "Бизнес-анализ": "Biznes tahlil",
  "Графический дизайн": "Grafik dizayn",
  "Разработка с нуля": "Noldan rivojlantirish",
  "Разработка мобильных проектов": "Mobil loyihalarni ishlab chiqish",
  "Костамизация готовых решений": "Tayyor yechimlarni sozlash",
  "Функциональное усовершенствование": "Funksional takomillashtirish",
  "Миграция приложений и данных": "Ilovalar va ma'lumotlarni ko'chirish",
  "Крупные компании, с которыми мы работаем и которые нам очень доверяют": "Biz ishlayotgan va bizga ishonadigan yirik kompaniyalar",
  "Увеличивайте трафик и продажи": "Trafik va savdolarni oshiring",
  "Увеличивайте трафик и продажи продукции": "Mahsulotlar trafikini va savdosini oshiring",
  "Почему выбрали нас?": "Nega bizni tanlaysiz?",
  "В сотрудничестве с вами мы создаем программный продукт, функциональные возможности которого полностью отвечают уникальным потребностям вашего бизнеса и особенностям услуг.": "Biznesingizning o'ziga xos ehtiyojlari va xizmat xususiyatlariga mos dasturiy mahsulot yaratamiz.",
  "Квалифицированная работа, умные решения": "Malakali ish, aqlli yechimlar",
  "Мы создаем новые корпоративные системы, компоненты и приложения любой сложности и масштаба, в том числе разрабатываем системы внутренней автоматизации Ваших бизнес процессов.": "Biz yangi korporativ tizimlar, komponentlar va har qanday murakkablikdagi ilovalarni yaratamiz, shu jumladan biznes jarayonlaringizni avtomatlashtirish tizimlarini ishlab chiqamiz.",
  "Эксклюзивность": "Eksklyuzivlik",
  "Специальная команда разработчиков полностью погружается в проект клиента, подстраиваясь под его бизнес-процессы и требования с учетом отраслевых особенностей компании заказчика.": "Maxsus dasturchilar jamoasi mijozning biznes jarayonlari va talablariga moslashib, loyihaga to'liq sho'ng'iydi.",
  "Оптимизация затрат": "Xarajatlarni optimallashtirish",
  "Сотрудничая с профессиональным поставщиком услуг по разработке программного обеспечения, вы не несете затрат на поиск, привлечение и подготовку собственной ИТ-команды.": "Professional dasturiy ta'minot xizmatlarini taqdim etuvchi yetkazib beruvchi bilan hamkorlik qilgan holda, o'zingizning IT-jamoangizni izlash, jalb qilish va tayyorlash bo'yicha xarajatlarni sezilarli darajada kamaytirasiz.",
  "Клиенты": "Mijozlar",
  "Проекты": "Loyihalar",
  "Лет на рынке разработки программного обеспечения": "Yillar dasturiy ta'minot bozorida",
  "Трудоголики": "Mehnatsevarlar"
}
